In [1]:
import pandas as pd

In [2]:
file_path = "shopping_data.csv"
df = pd.read_csv(file_path)
df.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [3]:
df.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [4]:
df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [7]:
for column in df.columns:
    print(f"Column{column} has {df[column].isnull().sum()} null values")

ColumnCustomerID has 0 null values
ColumnCard Member has 2 null values
ColumnAge has 2 null values
ColumnAnnual Income has 0 null values
ColumnSpending Score (1-100) has 1 null values

In [9]:
df= df.dropna()

In [11]:
#find duplicate entries
print(f"Duplicate entries : {df.duplicated().sum()}")

Duplicate entries : 0

In [15]:
# df.drop(columns=['CustomerID'], inplace = True)
df.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [18]:
#change Card member data to binary
def change_string(member):
    if member == "Yes":
        return 1
    else:
        return 0
df["Card Member"] = df["Card Member"].apply(change_string)
df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            0  19.0          15000                    39.0
1            0  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [28]:
df["Annual_Income"]= df["Annual_Income"]
df.head()

   Card_Member   Age  Annual_Income  Spending_Score
0            0  19.0           15.0            39.0
1            0  21.0           15.0            81.0
2            0  20.0           16.0             6.0
3            0  23.0           16.0            77.0
4            0  31.0           17.0            40.0

In [30]:
df = df.rename(columns={'Card Member': 'Card_Member', 'Age': 'Age', "Annual Income": "Annual_Income", "Spending Score (1-100)": "Spending_Score"})
df.head()

   Card_Member   Age  Annual_Income  Spending_Score
0            0  19.0           15.0            39.0
1            0  21.0           15.0            81.0
2            0  20.0           16.0             6.0
3            0  23.0           16.0            77.0
4            0  31.0           17.0            40.0

In [31]:
#saving cleaned data
file_path = "shopping_data_cleaned2.csv"
df.to_csv(file_path, index = False)